# SuperTravel RDBMS ETL Process
#### Group 2: Michelle Nie, Marley An, Rachel Liu, Zhiyuan Tang

## Preparation and Connect

In [216]:
import pandas as pd
from sqlalchemy import create_engine
import matplotlib.pyplot as plt
import pandas.io.sql as psql
import psycopg2, os
import numpy as np

In [217]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:123@localhost:5432/5310_P6'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

## ETL Process

## Website important components ETL:

### users table

In [182]:
# Creates a table named USERS: 

stmt = """

CREATE TABLE users (
  user_id INT,
  email VARCHAR(50) NOT NULL,
  first_name VARCHAR(50) NOT NULL,
  last_name VARCHAR(50) NOT NULL,
  gender VARCHAR(50) NOT NULL,
  date_of_birth DATE NOT NULL,
  address VARCHAR(200) NOT NULL,
  phone_number CHAR(30) NOT NULL,
  password VARCHAR(100) NOT NULL,
  credit_card_number CHAR(20) NOT NULL,
  PRIMARY KEY (user_id)
);

 """
connection.execute(stmt)

In [183]:
#Reads a CSV file named "usersdata.csv", then prints the first five rows
df = pd.read_csv('/Users/michellenie/Desktop/usersdata.csv')
df.head()

,user_id,email,first_name,last_name,gender,date_of_birth,address,phone_number,password,credit_card_number
0,1,ugoneau0@so-net.ne.jp,Uriah,Goneau,Male,06/19/1993,29921 Crowley Park,(917) 2551821,HADvNtYk6yt,5108755166742808
1,2,klamming1@amazonaws.com,Kass,Lamming,Female,06/25/1948,71010 Maple Wood Way,(224) 5219739,J8KZ9i,5108750355872698
2,3,iboycott2@ning.com,Iago,Boycott,Male,05/04/1974,73 Morrow Road,(947) 3104076,1BJFye,5048371621245487
3,4,senderson3@squarespace.com,Sasha,Enderson,Male,02/22/1944,35926 Toban Alley,(767) 3562623,v1jF2xKxv,5048376322196228
4,5,jjoffe4@chicagotribune.com,Jeffrey,Joffe,Male,09/23/2006,1 Lawn Point,(411) 1183754,XnDg7Z5,5108758436905718

In [185]:
#Creates a new DataFrame object "users_df" containing only the selected columns without duplicate rows
users_df = df[['user_id', 'email', 'first_name', 'last_name', 'gender', 'date_of_birth', 'address', 'phone_number', 'password','credit_card_number']]. drop_duplicates()
users_df

,user_id,email,first_name,last_name,gender,date_of_birth,address,phone_number,password,credit_card_number
0,1,ugoneau0@so-net.ne.jp,Uriah,Goneau,Male,06/19/1993,29921 Crowley Park,(917) 2551821,HADvNtYk6yt,5108755166742808
1,2,klamming1@amazonaws.com,Kass,Lamming,Female,06/25/1948,71010 Maple Wood Way,(224) 5219739,J8KZ9i,5108750355872698
2,3,iboycott2@ning.com,Iago,Boycott,Male,05/04/1974,73 Morrow Road,(947) 3104076,1BJFye,5048371621245487
3,4,senderson3@squarespace.com,Sasha,Enderson,Male,02/22/1944,35926 Toban Alley,(767) 3562623,v1jF2xKxv,5048376322196228
4,5,jjoffe4@chicagotribune.com,Jeffrey,Joffe,Male,09/23/2006,1 Lawn Point,(411) 1183754,XnDg7Z5,5108758436905718
...,...,...,...,...,...,...,...,...,...,...
995,996,tspradbrowrn@businessinsider.com,Terence,Spradbrow,Male,07/04/1979,959 Melby Road,(651) 4729019,ruuDUNR6r,5108754527994778
996,997,cpittetro@networkadvertising.org,Corabella,Pittet,Female,01/21/1943,53318 Annamark Way,(522) 5560261,e8xIhc99g4A,5048377481985724
997,998,kstudrp@free.fr,Kipper,Stud,Male,08/06/1952,9 Glacier Hill Street,(360) 9951992,f8eVCz,5108755052973954
998,999,fcicullorq@wix.com,Fleurette,Cicullo,Female,07/28/1979,50 Havey Pass,(306) 2374493,At2ma32b,5108755059581230
999,1000,gfearerr@themeforest.net,Gabriel,Feare,Male,03/12/1946,58170 Anthes Avenue,(990) 2646778,dEB2b11slB,5108753517795203

In [186]:
# Load the data into the "users" table
users_df.to_sql(name = 'users', con=engine, if_exists='append', index=False)

1000

### deals table

In [187]:
# Creates a table named deals:

stmt = """

CREATE TABLE deals (
    deal_id INT,
    user_id INT NOT NULL,
    start_date DATE,
    end_date DATE,
    deal_name VARCHAR(255),
    PRIMARY KEY (deal_id),
    FOREIGN KEY (user_id) REFERENCES users(user_id)
);

 """
connection.execute(stmt)

In [188]:
#Reads a CSV file named "dealsdata.csv", then prints the first five rows
df = pd.read_csv("/Users/michellenie/Desktop/dealsdata.csv")
df.head()

   deal_id  user_id  start_date    end_date              deal_name
0        1        1  07/22/2021  12/12/2022  Needleleaf Waternymph
1        2        2         NaN         NaN                    NaN
2        3        3  10/28/2020  12/02/2022               Bluebead
3        4        4  04/21/2020  11/13/2022             Red Fescue
4        5        5  09/15/2020  11/09/2022                  Kauri

In [189]:
#Creates a new DataFrame object "deals_df" containing only the selected columns without duplicate rows
deals_df = df[['deal_id', 'user_id', 'start_date', 'end_date', 'deal_name']]. drop_duplicates()
deals_df

     deal_id  user_id  start_date    end_date              deal_name
0          1        1  07/22/2021  12/12/2022  Needleleaf Waternymph
1          2        2         NaN         NaN                    NaN
2          3        3  10/28/2020  12/02/2022               Bluebead
3          4        4  04/21/2020  11/13/2022             Red Fescue
4          5        5  09/15/2020  11/09/2022                  Kauri
..       ...      ...         ...         ...                    ...
995      996      996  08/30/2021  10/27/2022        Leptobryum Moss
996      997      997  08/10/2021  12/11/2022      Silver Cinquefoil
997      998      998         NaN         NaN                    NaN
998      999      999         NaN         NaN                    NaN
999     1000     1000  07/15/2020  11/08/2022      Gerrard's Aristea

[1000 rows x 5 columns]

In [190]:
# Load the data into the "deals" table
deals_df.to_sql(name = 'deals', con=engine, if_exists='append', index=False)

1000

### orders table

In [191]:
# Creates a table named orders:  
stmt = """

CREATE TABLE orders (
    order_id INT,
    user_id INT NOT NULL,
    PRIMARY KEY (order_id, user_id),
    FOREIGN KEY (user_id) REFERENCES users(user_id)
);
 """
connection.execute(stmt)

In [192]:
#Reads a CSV file named "orders.csv", then prints the first five rows
df = pd.read_csv("/Users/michellenie/Desktop/orders.csv")
df

     order_id  user_id
0           1        1
1           2        2
2           3        3
3           4        4
4           5        5
..        ...      ...
995       996      996
996       997      997
997       998      998
998       999      999
999      1000     1000

[1000 rows x 2 columns]

In [193]:
#Creates a new DataFrame object "order_df" containing only the selected columns without duplicate rows
order_df = df[['user_id', 'order_id']]. drop_duplicates()
order_df

     user_id  order_id
0          1         1
1          2         2
2          3         3
3          4         4
4          5         5
..       ...       ...
995      996       996
996      997       997
997      998       998
998      999       999
999     1000      1000

[1000 rows x 2 columns]

In [194]:
# Load the data into the "orders" table
order_df.to_sql(name = 'orders', con=engine, if_exists='append', index=False)

1000

### reviews table

In [195]:
### REVIEWS ###
with engine.connect() as connection:
    # Add unique constraint to orders table
    connection.execute("""
        ALTER TABLE orders
        ADD CONSTRAINT orders_order_id_unique UNIQUE (order_id);
    """)

    # Create reviews table with foreign key constraints
    connection.execute("""
        CREATE TABLE reviews (
            date DATE,
            user_id INT,
            order_id INT,
            review VARCHAR(10000),
            PRIMARY KEY (date, user_id, order_id),
            FOREIGN KEY (user_id) REFERENCES users(user_id),
            FOREIGN KEY (order_id) REFERENCES orders(order_id)
        );
    """)

In [196]:
# Read the CSV files:"Hotel_Reviews.csv"
hotel_reviews_df = pd.read_csv("/Users/michellenie/Desktop/Hotel_Reviews.csv")
hotel_reviews_df.head()

,Hotel_Address,Additional_Number_of_Scoring,Review_Date,Average_Score,Hotel_Name,Reviewer_Nationality,Negative_Review,Review_Total_Negative_Word_Counts,Total_Number_of_Reviews,Positive_Review,Review_Total_Positive_Word_Counts,Total_Number_of_Reviews_Reviewer_Has_Given,Reviewer_Score,Tags,days_since_review,lat,lng
0,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,8/3/2017,7.7,Hotel Arena,Russia,I am so angry that i made this post available...,397,1403,Only the park outside of the hotel was beauti...,11,7,2.9,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,52.360576,4.915968
1,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,8/3/2017,7.7,Hotel Arena,Ireland,No Negative,0,1403,No real complaints the hotel was great great ...,105,7,7.5,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,52.360576,4.915968
2,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,7/31/2017,7.7,Hotel Arena,Australia,Rooms are nice but for elderly a bit difficul...,42,1403,Location was good and staff were ok It is cut...,21,9,7.1,"[' Leisure trip ', ' Family with young childre...",3 days,52.360576,4.915968
3,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,7/31/2017,7.7,Hotel Arena,United Kingdom,My room was dirty and I was afraid to walk ba...,210,1403,Great location in nice surroundings the bar a...,26,1,3.8,"[' Leisure trip ', ' Solo traveler ', ' Duplex...",3 days,52.360576,4.915968
4,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,7/24/2017,7.7,Hotel Arena,New Zealand,You When I booked with your company on line y...,140,1403,Amazing location and building Romantic setting,8,3,6.7,"[' Leisure trip ', ' Couple ', ' Suite ', ' St...",10 days,52.360576,4.915968

In [197]:
# Read the CSV files:"reviews.csv"
reviews_df = pd.read_csv("/Users/michellenie/Desktop/reviews.csv")
reviews_df

           date  user_id  order_id
0     9/23/2021        1         1
1    10/27/2020        2         2
2      6/3/2022        3         3
3     5/16/2020        4         4
4      2/7/2020        5         5
..          ...      ...       ...
995  11/20/2022      996       996
996   2/13/2022      997       997
997   9/14/2022      998       998
998    2/4/2023      999       999
999  10/12/2020     1000      1000

[1000 rows x 3 columns]

In [198]:
# Read the CSV files:"capstone_airline_reviews3.xlsx"
airline_reviews_df = pd.read_excel('/Users/michellenie/Desktop/capstone_airline_reviews3.xlsx', sheet_name='capstone_airline_reviews3')
airline_reviews_df

,airline,overall,author,review_date,customer_review,aircraft,traveller_type,cabin,route,date_flown,seat_comfort,cabin_service,food_bev,entertainment,ground_service,value_for_money,recommended
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Turkish Airlines,7.0,Christopher Hackley,8th May 2019,âœ… Trip Verified | London to Izmir via Istanb...,NaN,Business,Economy Class,London to Izmir via Istanbul,2019-05-01 00:00:00,4.0,5.0,4.0,4.0,2.0,4.0,yes
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Turkish Airlines,2.0,Adriana Pisoi,7th May 2019,âœ… Trip Verified | Istanbul to Bucharest. We ...,NaN,Family Leisure,Economy Class,Istanbul to Bucharest,2019-05-01 00:00:00,4.0,1.0,1.0,1.0,1.0,1.0,no
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
131890,Ukraine International,NaN,Andriy Yesypenko,19th May 2006,Kiev - London (Gatwick) in business class (in ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,no
131891,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
131892,Ukraine International,NaN,Volodya Bilotkach,29th April 2006,Several flights - KBP to AMS (3 times one way)...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,no
131893,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
131894,Ukraine International,NaN,Kasper Hettinga,10th February 2006,KBP-AMS with UIA. Although it was a relatively...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,no

In [199]:
# Sample and rename the columns in hotel_reviews_df
positive_reviews_df = hotel_reviews_df[['Positive_Review']].sample(n=300, random_state=42).reset_index(drop=True)
positive_reviews_df = positive_reviews_df.rename(columns={'Positive_Review': 'review'})
positive_reviews_df

                                                review
0     Hotel was great clean friendly staff free bre...
1                                          No Positive
2                           Nice welcoming and service
3     Everything including the nice upgrade The Hot...
4                      Lovely hotel v welcoming staff
..                                                 ...
295         Staff were great very friendly and helpful
296   Great location close to Bond Street and very ...
297                                     All was great
298   Very stylish d cor Complimentary tea or lovel...
299                                        No Positive

[300 rows x 1 columns]

In [200]:
# Sample and rename the columns in airline_reviews_df
airline_reviews_sampled = airline_reviews_df[['customer_review']].sample(n=200, random_state=42).reset_index(drop=True)
airline_reviews_sampled = airline_reviews_sampled.rename(columns={'customer_review': 'review'})
airline_reviews_sampled

                                                review
0                                                  NaN
1    I wont comment much on the short haul since th...
2    Two flights - Tokyo to Guangzhou and Guangzhou...
3    PER-BKK-LHR quite unhappy with the experience ...
4                                                  NaN
..                                                 ...
195  âœ… Trip Verified | Brisbane to Munich via Ban...
196                                                NaN
197                                                NaN
198  Washington to San Diego and San Francisco to W...
199                                                NaN

[200 rows x 1 columns]

In [201]:
# Concatenate the hotel and airline reviews
hotel_airline_reviews = pd.concat([positive_reviews_df, airline_reviews_sampled], ignore_index=True)
hotel_airline_reviews

                                                review
0     Hotel was great clean friendly staff free bre...
1                                          No Positive
2                           Nice welcoming and service
3     Everything including the nice upgrade The Hot...
4                      Lovely hotel v welcoming staff
..                                                 ...
495  âœ… Trip Verified | Brisbane to Munich via Ban...
496                                                NaN
497                                                NaN
498  Washington to San Diego and San Francisco to W...
499                                                NaN

[500 rows x 1 columns]

In [202]:
# Add NaN for the remaining 500 rows
hotel_airline_reviews = hotel_airline_reviews.reindex(range(1000))
merged_df = pd.concat([reviews_df, hotel_airline_reviews], axis=1)

In [203]:
merged_df

,date,user_id,order_id,review
0,9/23/2021,1,1,Hotel was great clean friendly staff free bre...
1,10/27/2020,2,2,No Positive
2,6/3/2022,3,3,Nice welcoming and service
3,5/16/2020,4,4,Everything including the nice upgrade The Hot...
4,2/7/2020,5,5,Lovely hotel v welcoming staff
...,...,...,...,...
995,11/20/2022,996,996,NaN
996,2/13/2022,997,997,NaN
997,9/14/2022,998,998,NaN
998,2/4/2023,999,999,NaN
999,10/12/2020,1000,1000,NaN

In [204]:
# Load the data into the "reviews" table
merged_df.to_sql(name = 'reviews', con=engine, if_exists='append', index=False)

1000

### city table

In [205]:
# Reads a CSV file:"city.csv" and drops specific columns:'city_id', 'zipcode'
city_df = pd.read_csv("/Users/michellenie/Desktop/city.csv")

city_df.drop(['city_id', 'zipcode'], axis=1, inplace=True)
city_df.head()

         city_name         state        country
0     Wilkes Barre  Pennsylvania  United States
1    New York City      New York  United States
2  Fort Lauderdale       Florida  United States
3       Fort Worth         Texas  United States
4          Houston         Texas  United States

In [206]:
with engine.connect() as connection:
    stmt = """
    CREATE TABLE city (
      city_id INT,
      city_name VARCHAR(100),
      state VARCHAR(100),
      country VARCHAR(100),
      PRIMARY KEY (city_id)
    );
    """
    connection.execute(stmt)

In [208]:
# Read the CSV files:"national_list.csv"
df_hotel = pd.read_csv('/Users/michellenie/Downloads/national_list.csv',encoding='latin-1')

df_hotel.head()

,FEMA ID,Name,P.O. Box,Street,City,State,ZIP code,Stories,Phone,Property Type,Sprinklers
0,VA6026,Mint House Alexandria - Old Town,NaN,750 Thornton Way,Alexandria,Virginia,22314,5.0,855-972-9090,Apartment/Condo,Sprinkler System Present
1,AL5585,Mint House Birmingham - Downtown,NaN,300 18th St,Birmingham,Alabama,35233,7.0,855-972-9090,Apartment/Condo,Sprinkler System Present
2,TX8647,Mint House Dallas - Downtown,NaN,1601 Elm St,Dallas,Texas,75201,50.0,855-972-9090,Apartment/Condo,Sprinkler System Present
3,TX8648,Mint House at The Hatchery - Austin,NaN,49 Navasota St,Austin,Texas,78702,2.0,855-972-9090,Apartment/Condo,Sprinkler System Present
4,TX8649,Mint House Austin - South Congress,NaN,1007 S Congress Ave,Austin,Texas,78704,4.0,855-972-9090,Apartment/Condo,Sprinkler System Present

In [209]:
#select the needed column for "city" table 
temp_city_df = df_hotel[["City", "State"]]

#drop NaN value
temp_city_df1 = temp_city_df.dropna()

#drop duplicates
temp_city_df2 = temp_city_df1.drop_duplicates()

temp_city_df2

                City           State
0         Alexandria        Virginia
1         Birmingham         Alabama
2             Dallas           Texas
3             Austin           Texas
5          Nashville       Tennessee
...              ...             ...
52175  Granada Hills      California
52192    Folly Beach  South Carolina
52224    West Jordan            Utah
52228          Derby          Kansas
52233          OCALA         Florida

[8476 rows x 2 columns]

In [210]:
#Although the company only focus on hotels in the US at this time, we will add a new column named "country" with the same value "United States". If the company plans to expand in other countries, we will include other countries'names as well. 
temp_city_df2['country'] = "United States"

#select the needed column 
temp_city_df3 = temp_city_df2.rename(columns = {"City": "city_name", "State": "state"})

temp_city_df3

/var/folders/8w/qzhcf4_x5sdfwh0p0cgkcfzr0000gn/T/ipykernel_45929/309663473.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  temp_city_df2['country'] = "United States"

           city_name           state        country
0         Alexandria        Virginia  United States
1         Birmingham         Alabama  United States
2             Dallas           Texas  United States
3             Austin           Texas  United States
5          Nashville       Tennessee  United States
...              ...             ...            ...
52175  Granada Hills      California  United States
52192    Folly Beach  South Carolina  United States
52224    West Jordan            Utah  United States
52228          Derby          Kansas  United States
52233          OCALA         Florida  United States

[8476 rows x 3 columns]

In [211]:
#join the "city_df" created above and "temp_city_df3" with more rows 
city_df = city_df.append(temp_city_df3, ignore_index=True)
city_df

/var/folders/8w/qzhcf4_x5sdfwh0p0cgkcfzr0000gn/T/ipykernel_45929/2191485729.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  city_df = city_df.append(temp_city_df3, ignore_index=True)

            city_name           state        country
0        Wilkes Barre    Pennsylvania  United States
1       New York City        New York  United States
2     Fort Lauderdale         Florida  United States
3          Fort Worth           Texas  United States
4             Houston           Texas  United States
...               ...             ...            ...
9471    Granada Hills      California  United States
9472      Folly Beach  South Carolina  United States
9473      West Jordan            Utah  United States
9474            Derby          Kansas  United States
9475            OCALA         Florida  United States

[9476 rows x 3 columns]

In [212]:
#drop duplicates 
city_df.drop_duplicates(subset=['city_name', 'state'], inplace=True)

city_df

            city_name           state        country
0        Wilkes Barre    Pennsylvania  United States
1       New York City        New York  United States
2     Fort Lauderdale         Florida  United States
3          Fort Worth           Texas  United States
4             Houston           Texas  United States
...               ...             ...            ...
9471    Granada Hills      California  United States
9472      Folly Beach  South Carolina  United States
9473      West Jordan            Utah  United States
9474            Derby          Kansas  United States
9475            OCALA         Florida  United States

[8482 rows x 3 columns]

In [213]:
#create a new column with incrementing integer numbers for city_id
city_df.insert(0, 'city_id', range(1, 1 + len(city_df)))

city_df

      city_id        city_name           state        country
0           1     Wilkes Barre    Pennsylvania  United States
1           2    New York City        New York  United States
2           3  Fort Lauderdale         Florida  United States
3           4       Fort Worth           Texas  United States
4           5          Houston           Texas  United States
...       ...              ...             ...            ...
9471     8478    Granada Hills      California  United States
9472     8479      Folly Beach  South Carolina  United States
9473     8480      West Jordan            Utah  United States
9474     8481            Derby          Kansas  United States
9475     8482            OCALA         Florida  United States

[8482 rows x 4 columns]

In [214]:
# Load the data into the "city" table
city_df.to_sql(name = 'city', con=engine, if_exists='append', index=False)

482

## Hotel Management Subdivison ETL:

In [218]:
# Pass the SQL statements that create tables
stmt = """
CREATE Table hotels(
	hotel_id		int,
	hotel_name		varchar(100) NOT NULL,
	star			integer,
	city_id			integer,
	hotel_address	varchar(200), 
	PRIMARY KEY (hotel_id),
	FOREIGN KEY(city_id) REFERENCES city(city_id)
);

CREATE TABLE hotel_room_types(
	room_type_id	integer,
	hotel_id		integer,
	room_type		varchar(200) NOT NULL,
	rate_per_night	money NOT NULL,
	note			text,
	PRIMARY KEY(room_type_id),
	FOREIGN KEY(hotel_id) REFERENCES hotels (hotel_id)
);

CREATE TABLE hotel_reservations(
	hotel_reservation_id	int,
	user_id					int,
	hotel_id				int,
	room_type_id			int,
	check_in_date			timestamp NOT NULL,
	check_out_date			timestamp NOT NULL,
	total_price				money NOT NULL,
	PRIMARY KEY (hotel_reservation_id),
	FOREIGN KEY (user_id) REFERENCES users (user_id),
	FOREIGN KEY (hotel_id) REFERENCES hotels (hotel_id),
	FOREIGN KEY (room_type_id) REFERENCES hotel_room_types (room_type_id)
); 

CREATE TABLE hotel_orders(
	order_id				int,
	hotel_reservation_id	int,
	PRIMARY KEY(order_id, hotel_reservation_id),
	FOREIGN KEY(hotel_reservation_id) REFERENCES hotel_reservations (hotel_reservation_id)
);
"""
# Execute the statement to create tables
connection.execute(stmt)

### hotels table

In [219]:
#read "national_list.csv" data
df_hotel = pd.read_csv('/Users/michellenie/Downloads/national_list.csv',encoding='latin-1')

df_hotel.head()

,FEMA ID,Name,P.O. Box,Street,City,State,ZIP code,Stories,Phone,Property Type,Sprinklers
0,VA6026,Mint House Alexandria - Old Town,NaN,750 Thornton Way,Alexandria,Virginia,22314,5.0,855-972-9090,Apartment/Condo,Sprinkler System Present
1,AL5585,Mint House Birmingham - Downtown,NaN,300 18th St,Birmingham,Alabama,35233,7.0,855-972-9090,Apartment/Condo,Sprinkler System Present
2,TX8647,Mint House Dallas - Downtown,NaN,1601 Elm St,Dallas,Texas,75201,50.0,855-972-9090,Apartment/Condo,Sprinkler System Present
3,TX8648,Mint House at The Hatchery - Austin,NaN,49 Navasota St,Austin,Texas,78702,2.0,855-972-9090,Apartment/Condo,Sprinkler System Present
4,TX8649,Mint House Austin - South Congress,NaN,1007 S Congress Ave,Austin,Texas,78704,4.0,855-972-9090,Apartment/Condo,Sprinkler System Present

In [220]:
#I could't find data for the hotel star, so I use random.randint to random assign each hotel a star.
df_hotel['star'] = np.random.randint(1, 6, size=len(df_hotel))

In [221]:
#rename table column 
temp_hotel_df = df_hotel.rename(columns={"Name": "hotel_name", "Street": "hotel_address",
                                         "City": "city_name", "State": "state"})
#select the needed column
hotel_df = temp_hotel_df[['hotel_name', 'hotel_address', "star", "city_name", "state"]]

#replace the "FEMA ID" (char 6) column with a new column "hotel_id" (integer)
#create a new column with incrementing integer numbers for hotel_id
hotel_df.insert(0, 'hotel_id', range(1, 1 + len(hotel_df)))

hotel_df

,hotel_id,hotel_name,hotel_address,star,city_name,state
0,1,Mint House Alexandria - Old Town,750 Thornton Way,4,Alexandria,Virginia
1,2,Mint House Birmingham - Downtown,300 18th St,1,Birmingham,Alabama
2,3,Mint House Dallas - Downtown,1601 Elm St,3,Dallas,Texas
3,4,Mint House at The Hatchery - Austin,49 Navasota St,2,Austin,Texas
4,5,Mint House Austin - South Congress,1007 S Congress Ave,2,Austin,Texas
...,...,...,...,...,...,...
52243,52244,La Quinta Inn & Suites/albuq West,6101 CLF Rd NW,3,Albuquerque,New Mexico
52244,52245,Quality Inn St George,6014 Jim Bilton Blvd,2,ST George,South Carolina
52245,52246,Rodeway Inn,US 21 Bypass/261 Anderson Rd,2,Rock Hill,South Carolina
52246,52247,Comfort Suites,3608 Richland Ave US Hwy 1,2,Aiken,South Carolina
52247,52248,Comfort Inn,NaN,1,NaN,NaN

In [222]:
#merge two tables 
merged_df = pd.merge(hotel_df, city_df, on= ['city_name', "state"])

#select the needed columns 
df_hotel2 = merged_df[["hotel_id", "hotel_name", "hotel_address", "city_id", "star"]]

In [223]:
#load the data into "hotels" table
df_hotel2.to_sql(name='hotels', con=engine, if_exists='append', index=False)

247

### hotel_room_types table

In [224]:
#read hotel room type data
df_room = pd.read_csv('/Users/michellenie/Desktop/booking_com-travel_sample 2.csv') 

#select the needed column 
df_room1 = df_room[['room_type']]

In [225]:
#drop null values and dulplicated values
df_room2 = df_room1.dropna()

df_room3 = df_room2.drop_duplicates()

df_room3

                               room_type
0                    Economy Double Room
1                  British Empire Chalet
3                            Deluxe Room
4                            Mobile Home
5             Standard Room in Apartment
...                                  ...
5742  Double or Twin Room with Extra Bed
5752      Apartment With Shared Bathroom
5909           Family Room with Bathroom
5920    Bunk Bed in Mixed Dormitory Room
5923         Standard Double Room Non AC

[391 rows x 1 columns]

In [226]:
#create a new column with incrementing integer numbers for room_type_id
df_room3.insert(0, 'room_type_id', range(1, 1 + len(df_room3)))

df_room3

      room_type_id                           room_type
0                1                 Economy Double Room
1                2               British Empire Chalet
3                3                         Deluxe Room
4                4                         Mobile Home
5                5          Standard Room in Apartment
...            ...                                 ...
5742           387  Double or Twin Room with Extra Bed
5752           388      Apartment With Shared Bathroom
5909           389           Family Room with Bathroom
5920           390    Bunk Bed in Mixed Dormitory Room
5923           391         Standard Double Room Non AC

[391 rows x 2 columns]

In [227]:
#read total price data
df_rate = pd.read_csv('/Users/michellenie/Desktop/hotels.csv') 

#select the needed column 
df_rate1 = df_rate[["price"]]

In [228]:
#We only have 391 room types ID, so I select 391 values for room rate per night. 
df_rate2 = df_rate1.head(391)

#create a new column with incrementing integer numbers for room_type_id
df_rate2.insert(0, 'room_type_id', range(1, 1 + len(df_rate2)))

df_rate2

     room_type_id   price
0               1  313.02
1               2  263.41
2               3  263.41
3               4  263.41
4               5  313.02
..            ...     ...
386           387  242.88
387           388  165.99
388           389  208.04
389           390  165.99
390           391  165.99

[391 rows x 2 columns]

In [229]:
#merge the "room type" table and "total price" table 
df_rate3 = pd.merge(df_room3, df_rate2, on= "room_type_id")

df_rate3

     room_type_id                           room_type   price
0               1                 Economy Double Room  313.02
1               2               British Empire Chalet  263.41
2               3                         Deluxe Room  263.41
3               4                         Mobile Home  263.41
4               5          Standard Room in Apartment  313.02
..            ...                                 ...     ...
386           387  Double or Twin Room with Extra Bed  242.88
387           388      Apartment With Shared Bathroom  165.99
388           389           Family Room with Bathroom  208.04
389           390    Bunk Bed in Mixed Dormitory Room  165.99
390           391         Standard Double Room Non AC  165.99

[391 rows x 3 columns]

In [230]:
#Since the table doesn't contain a hotel id, I randomly assign a hotel id to the table. 
df_rate3['hotel_id'] = np.random.randint(1, 52247, size=len(df_rate3))

df_rate3

     room_type_id                           room_type   price  hotel_id
0               1                 Economy Double Room  313.02     25949
1               2               British Empire Chalet  263.41     19740
2               3                         Deluxe Room  263.41     24980
3               4                         Mobile Home  263.41     36971
4               5          Standard Room in Apartment  313.02     23328
..            ...                                 ...     ...       ...
386           387  Double or Twin Room with Extra Bed  242.88     12014
387           388      Apartment With Shared Bathroom  165.99      3116
388           389           Family Room with Bathroom  208.04      2588
389           390    Bunk Bed in Mixed Dormitory Room  165.99     23030
390           391         Standard Double Room Non AC  165.99     31544

[391 rows x 4 columns]

In [231]:
#add a new column for "note"
df_rate3['note'] = None

#rename column name
room_type_df = df_rate3.rename(columns={"price": "rate_per_night"})

room_type_df

,room_type_id,room_type,rate_per_night,hotel_id,note
0,1,Economy Double Room,313.02,25949,None
1,2,British Empire Chalet,263.41,19740,None
2,3,Deluxe Room,263.41,24980,None
3,4,Mobile Home,263.41,36971,None
4,5,Standard Room in Apartment,313.02,23328,None
...,...,...,...,...,...
386,387,Double or Twin Room with Extra Bed,242.88,12014,None
387,388,Apartment With Shared Bathroom,165.99,3116,None
388,389,Family Room with Bathroom,208.04,2588,None
389,390,Bunk Bed in Mixed Dormitory Room,165.99,23030,None
390,391,Standard Double Room Non AC,165.99,31544,None

In [232]:
#load data into "hotel_room_types" table
room_type_df.to_sql(name='hotel_room_types', con=engine, if_exists='append', index=False)

391

### hotel_reservations table

In [233]:
#rename column
df_booking = df_rate.rename(columns = {"travelCode": "hotel_reservation_id", "userCode": "user_id", 
                                       "total": "total_price", "date": "check_in_date"})

#select needed columns
df_booking1 = df_booking[["hotel_reservation_id", "user_id", "total_price", "check_in_date"]]

df_booking1

       hotel_reservation_id  user_id  total_price check_in_date
0                         0        0      1252.08    09/26/2019
1                         2        0       526.82    10/10/2019
2                         7        0       790.23    11/14/2019
3                        11        0      1053.64    12/12/2019
4                        13        0       313.02    12/26/2019
...                     ...      ...          ...           ...
40547                135938     1339       742.86    06/18/2020
40548                135939     1339       247.62    06/25/2020
40549                135940     1339       181.17    07/02/2020
40550                135941     1339       181.17    07/09/2020
40551                135942     1339       971.52    07/16/2020

[40552 rows x 4 columns]

In [234]:
#The hotel_reservations table contains mock data and real data. 
df_booking1['hotel_id'] = np.random.randint(1, 10000, size=len(df_booking1))

df_booking1["room_type_id"] = np.random.randint(1, 391, size=len(df_booking1))

df_booking1

/var/folders/8w/qzhcf4_x5sdfwh0p0cgkcfzr0000gn/T/ipykernel_45929/3370850115.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_booking1['hotel_id'] = np.random.randint(1, 10000, size=len(df_booking1))
/var/folders/8w/qzhcf4_x5sdfwh0p0cgkcfzr0000gn/T/ipykernel_45929/3370850115.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_booking1["room_type_id"] = np.random.randint(1, 391, size=len(df_booking1))

,hotel_reservation_id,user_id,total_price,check_in_date,hotel_id,room_type_id
0,0,0,1252.08,09/26/2019,2002,145
1,2,0,526.82,10/10/2019,5313,332
2,7,0,790.23,11/14/2019,6448,240
3,11,0,1053.64,12/12/2019,2362,80
4,13,0,313.02,12/26/2019,3997,191
...,...,...,...,...,...,...
40547,135938,1339,742.86,06/18/2020,8347,237
40548,135939,1339,247.62,06/25/2020,3246,227
40549,135940,1339,181.17,07/02/2020,6855,51
40550,135941,1339,181.17,07/09/2020,9971,383
40551,135942,1339,971.52,07/16/2020,7476,192

In [235]:
# convert check_in_date column to datetime format
df_booking1['check_in_date'] = pd.to_datetime(df_booking1['check_in_date'])

# generate a random number of days between 2 and 5 for each row
random_days = np.random.randint(1, 6, size=len(df_booking1))

# add a new column with randomized check_out_dates
df_booking1['check_out_date'] = df_booking1['check_in_date'] + pd.to_timedelta(random_days, unit='d')

/var/folders/8w/qzhcf4_x5sdfwh0p0cgkcfzr0000gn/T/ipykernel_45929/1525790175.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_booking1['check_in_date'] = pd.to_datetime(df_booking1['check_in_date'])
/var/folders/8w/qzhcf4_x5sdfwh0p0cgkcfzr0000gn/T/ipykernel_45929/1525790175.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_booking1['check_out_date'] = df_booking1['check_in_date'] + pd.to_timedelta(random_days, unit='d')

In [236]:
df_booking2 = df_booking1.head(28000)
df_booking3 = df_booking2.tail(27973)

In [237]:
#load data into "hotel_reservations" table
df_booking3.to_sql(name='hotel_reservations', con=engine, if_exists='append', index=False)

973

### hotel_orders table

In [238]:
#read "orders.csv" file
df_order = pd.read_csv('/Users/michellenie/Desktop/orders.csv') 

df_order

     order_id  user_id
0           1        1
1           2        2
2           3        3
3           4        4
4           5        5
..        ...      ...
995       996      996
996       997      997
997       998      998
998       999      999
999      1000     1000

[1000 rows x 2 columns]

In [239]:
#Join "orders" table with "hotel_reservations" table
df_order1 = pd.merge(df_order, df_booking3, on= ["user_id"])

#select the needed columns 
df_hotel_order = df_order1[["order_id", "hotel_reservation_id"]]

df_hotel_order

       order_id  hotel_reservation_id
0             1                    90
1             1                    92
2             2                   100
3             2                   101
4             2                   105
...         ...                   ...
27968       930                 94172
27969       930                 94175
27970       931                 94180
27971       931                 94182
27972       931                 94188

[27973 rows x 2 columns]

In [240]:
#load data into "hotel_orders" table 
df_hotel_order.to_sql(name='hotel_orders', con=engine, if_exists='append', index=False)

973

## Car Rental Subdivision ETL:

### car_rental_companies table

In [241]:
# Pass the SQL statements that create car_rental_companies table
stmt = """

Create table car_rental_companies (
	car_rental_company_id	int,
	car_rental_company_name		varchar(50),
	Primary key (car_rental_company_id)
);

"""
# Execute the statement to create tables
connection.execute(stmt)

In [242]:
# Read the dataset
car_rental_companies_df = pd.read_csv("/Users/michellenie/Desktop/car_rental_companies.csv")

In [243]:
# Check data frame
car_rental_companies_df

    car_rental_company_id car_rental_company_name
0                       1                   Hertz
1                       2                    Avis
2                       3   Enterprise Rent-A-Car
3                       4       Budget Rent a Car
4                       5     National Car Rental
5                       6        Alamo Rent a Car
6                       7      Thrifty Car Rental
7                       8         Sixt Rent a Car
8                       9      Payless Car Rental
9                      10          Fox Rent a Car
10                     11    Advantage Rent a Car
11                     12          E-Z Rent-A-Car
12                     13                Europcar
13                     14                  Dollar

In [244]:
# Import the dataframe into SQL
car_rental_companies_df.to_sql(name='car_rental_companies', con=connection, if_exists='append', index=False)

14

### cars table

In [245]:
# Pass the SQL statements that create cars table
stmt = """

Create table cars (
    car_id     int,
    car_rental_company_id	int,
    brand		varchar(30),
    model		varchar(30),
    fuel_type	varchar(50),
    Primary key (car_id),
    Foreign key (car_rental_company_id) references car_rental_companies (car_rental_company_id)
);

"""
# Execute the statement to create tables
connection.execute(stmt)

In [246]:
# Read the car dataset into a DataFrame
cars_df = pd.read_csv("/Users/michellenie/Desktop/Car_Dataset.csv")

In [247]:
# Check the dataframe
cars_df

,Unnamed: 0,Id,year,brand,full_model_name,model_name,price,distance_travelled(kms),fuel_type,city,...,new and less used,inv_car_price,inv_car_dist,inv_car_age,inv_brand,std_invprice,std_invdistance_travelled,std_invrank,best_buy1,best_buy2
0,0,0,2016,Honda,Honda Brio S MT,Brio,425000.0,9680.0,Petrol,Mumbai,...,0,2.352941e-06,0.000103,0.200000,0.142857,0.143417,0.035730,0.132143,677.134239,0.000000
1,1,1,2012,Nissan,Nissan Sunny XV Diesel,Sunny,325000.0,119120.0,Diesel,Mumbai,...,0,3.076923e-06,0.000008,0.111111,0.090909,0.188859,0.002496,0.079545,37.501318,0.000000
2,2,2,2017,Toyota,Toyota Fortuner 2.8 4x2 MT [2016-2020],Fortuner,2650000.0,64593.0,Diesel,Thane,...,0,3.773585e-07,0.000015,0.250000,1.000000,0.019416,0.004978,1.000000,96.646020,0.000000
3,3,3,2017,Mercedes-Benz,Mercedes-Benz E-Class E 220d Expression [2019-...,E-Class,4195000.0,25000.0,Diesel,Mumbai,...,1,2.383790e-07,0.000040,0.250000,0.500000,0.010692,0.013563,0.493750,71.604306,71.604306
4,4,4,2012,Hyundai,Hyundai Verna Fluidic 1.6 CRDi SX,Verna,475000.0,23800.0,Diesel,Mumbai,...,0,2.105263e-06,0.000042,0.111111,0.071429,0.127871,0.014269,0.059821,109.150857,0.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1720,1720,1720,2015,Hyundai,Hyundai Eon Era +,Eon,290000.0,38000.0,Petrol,Pune,...,0,3.448276e-06,0.000026,0.166667,0.071429,0.212168,0.008771,0.059821,111.327773,0.000000
1721,1721,1721,2011,Bentley,Bentley Continental Flying Spur W12,Continental,7500000.0,36000.0,Petrol,Pune,...,0,1.333333e-07,0.000028,0.100000,0.022727,0.004099,0.009283,0.010511,0.399987,0.000000
1722,1722,1722,2008,Mahindra-Renault,Mahindra-Renault Logan DLE 1.5 dci,Logan,185000.0,142522.0,Diesel,Pune,...,0,5.405405e-06,0.000007,0.076923,0.041667,0.335011,0.002014,0.029687,20.026662,0.000000
1723,1723,1723,1990,Mahindra,Mahindra Jeep CJ 500 D,Jeep,325000.0,18581.0,Diesel,Pune,...,0,3.076923e-06,0.000054,0.032258,0.041667,0.188859,0.018402,0.029687,103.172958,0.000000
1724,1724,1724,2017,Hyundai,Hyundai Creta SX Plus 1.6 AT CRDI,Creta,1395000.0,31028.0,Diesel,Pune,...,0,7.168459e-07,0.000032,0.250000,0.071429,0.040724,0.010842,0.059821,26.412891,0.000000

In [248]:
# Generate unique car_id values starting from 1
car_id_list = list(range(1, len(cars_df) + 1))

# Add the car_id column to the DataFrame
cars_df['car_id'] = car_id_list

In [249]:
# Generate mock data for car_rental_company_id column
import random
car_rental_company_id_list = [random.randint(1, 14) for i in range(len(cars_df))]
cars_df['car_rental_company_id'] = car_rental_company_id_list

In [250]:
# Rename the model_name column to model
cars_df = cars_df.rename(columns={'model_name': 'model'})

In [251]:
# Clean the dataset to only include columns we need
cars_df = cars_df[['car_id', 'car_rental_company_id', 'brand', 'model', 'fuel_type']]

In [252]:
# Check cleaned dataset
cars_df

      car_id  car_rental_company_id             brand        model fuel_type
0          1                     12             Honda         Brio    Petrol
1          2                     14            Nissan        Sunny    Diesel
2          3                      5            Toyota     Fortuner    Diesel
3          4                     11     Mercedes-Benz      E-Class    Diesel
4          5                      2           Hyundai        Verna    Diesel
...      ...                    ...               ...          ...       ...
1720    1721                      2           Hyundai          Eon    Petrol
1721    1722                      6           Bentley  Continental    Petrol
1722    1723                      8  Mahindra-Renault        Logan    Diesel
1723    1724                      2          Mahindra         Jeep    Diesel
1724    1725                     14           Hyundai        Creta    Diesel

[1725 rows x 5 columns]

In [253]:
# Import data into SQL
cars_df.to_sql(name='cars', con=connection, if_exists='append', index=False)

725

### car_rental_reservation table

In [254]:
# Pass the SQL statements that create car_rental_reservation table
stmt = """

Create table car_rental_reservation (
    car_rental_reservation_id    int,
    car_id     int,
    pick_up_city    int,
    drop_off_city    int,
    pick_up_location     varchar(100) NOT NULL,
    drop_off_location	varchar(100) NOT NULL,
    pick_up_date	date NOT NULL,
    drop_off_date	date NOT NULL,
    total_price		money NOT NULL,
    Primary key (car_rental_reservation_id),
    Foreign key (car_id) references cars (car_id),
    Foreign key (pick_up_city) references city (city_id),
    Foreign key (drop_off_city) references city (city_id)
);

"""
# Execute the statement to create tables
connection.execute(stmt)

In [255]:
# Read the car rental reservations table
car_rental_reservation_df = pd.read_csv("/Users/michellenie/Desktop/car_rental_reservations.csv")

In [256]:
# Check the dataframe
car_rental_reservation_df

,car_rental_reservation_id,car_id,pick_up_city,drop_off_city,pick_up_location,drop_off_location,pick_up_date,drop_off_date,total_price
0,1,1564,42,43,5 Sachtjen Parkway,32 Arkansas Avenue,08/28/2021,08/29/2021,181.03
1,2,1670,238,239,88 Nancy Terrace,61678 Barby Point,01/05/2021,01/12/2021,385.69
2,3,1039,228,228,994 Forest Run Junction,31427 Pine View Avenue,08/08/2022,08/13/2022,322.16
3,4,1714,237,239,12715 Prairieview Drive,15 Monterey Street,02/01/2020,02/06/2020,110.20
4,5,302,135,136,28 Bultman Lane,18929 Surrey Terrace,01/22/2022,02/05/2022,130.77
...,...,...,...,...,...,...,...,...,...
495,496,213,93,95,23 Ryan Point,1317 David Lane,06/15/2020,06/23/2020,160.95
496,497,264,194,196,85894 Sauthoff Pass,9980 Vahlen Pass,10/06/2020,10/10/2020,208.35
497,498,974,56,58,224 Dixon Parkway,790 Banding Park,10/07/2019,10/18/2019,583.54
498,499,991,71,73,388 Delladonna Place,452 Bellgrove Place,12/17/2020,12/25/2020,781.87
499,500,205,67,69,5 Russell Road,963 Vahlen Place,07/10/2019,07/25/2019,359.61

In [257]:
# The dataframe's name match the columns in the table for this specific instance, so we can directly import 
car_rental_reservation_df.to_sql(name='car_rental_reservation', con=connection, if_exists='append', index=False)

500

### car_rental_orders table

In [258]:
# Pass the SQL statements that create all tables
stmt = """

CREATE TABLE car_rental_orders(
	order_id				int,
	car_rental_reservation_id	int,
	PRIMARY KEY(order_id, car_rental_reservation_id),
    FOREIGN KEY (order_id) REFERENCES orders (order_id),
	FOREIGN KEY(car_rental_reservation_id) REFERENCES car_rental_reservation (car_rental_reservation_id)
);

"""
# Execute the statement to create tables
connection.execute(stmt)

In [259]:
# Read the dataframe
car_rental_orders_df = pd.read_csv("/Users/michellenie/Desktop/car_rental_orders.csv")

In [260]:
# Check the dataframe
car_rental_orders_df

     order_id  car_rental_reservation_id
0           1                          1
1           2                          2
2           3                          3
3           4                          4
4           5                          5
..        ...                        ...
495       496                        496
496       497                        497
497       498                        498
498       499                        499
499       500                        500

[500 rows x 2 columns]

In [261]:
# Add the dataframe to SQL
car_rental_orders_df.to_sql(name='car_rental_orders', con=connection, if_exists='append', index=False)

500

## Flights Subdivision ETL:

In [262]:
#read csv file into the dataframe
df = pd.read_csv('/Users/michellenie/Desktop/final_flight.csv')

In [263]:
#check the dataset
df.head()

,departure_date,arrival_date,user_id,departure_city_id,arrival_city_id,airline_name,aircraft,seat_type,price,carryon_luggage,checked_luggage
0,6/3/2021 15:28,6/3/2021 23:28,NaN,109,211,American Airlines,Airbus A320,economy,$165.80,1,2
1,4/8/2020 2:36,4/8/2020 9:36,NaN,106,234,American Airlines,Airbus A320,economy,$503.77,1,1
2,1/3/2021 21:36,1/4/2021 8:36,NaN,131,13,American Airlines,Airbus A320,economy,$639.36,0,1
3,11/11/2022 1:17,11/11/2022 3:17,511.0,119,243,American Airlines,Airbus A320,economy,$105.01,1,2
4,5/29/2020 9:52,5/29/2020 12:52,528.0,223,139,American Airlines,Airbus A320,economy,$362.58,0,0

In [264]:
#Create all the flight related tables
stmt = """

CREATE TABLE flight_seat(
	flight_seat_id INT,
	seat_type varchar(20),
	price money,
	carryon_luggage int,
	checked_luggage int,
	PRIMARY KEY(flight_seat_id)
);


CREATE TABLE airline (
	airline_id INT,
	airline_name varchar(20),
	aircraft varchar(20),
	PRIMARY KEY(airline_id)
);


CREATE TABLE flight(
	flight_id INT,
	departure_city_id INT,
	arrival_city_id INT,
	airline_id INT,
    departure_date timestamp,
    arrival_date timestamp,
	PRIMARY KEY (flight_id),
	FOREIGN KEY (departure_city_id) REFERENCES city(city_id),
	FOREIGN KEY (arrival_city_id) REFERENCES city(city_id),
	FOREIGN KEY (airline_id) REFERENCES airline(airline_id)
	);
	
    
CREATE TABLE flight_reservation(
    flight_reservation_id INT,
    flight_id INT,
    user_id INT,
    flight_seat_id INT references flight_seat(flight_seat_id),
    primary key (flight_reservation_id),
    foreign key (flight_id) references flight(flight_id),
    foreign key (user_id) references users(user_id)
	);
    
    
CREATE TABLE order_flight(
    order_id int,
    flight_reservation_id int,
    PRIMARY KEY(order_id, flight_reservation_id),
	FOREIGN KEY(flight_reservation_id) REFERENCES flight_reservation (flight_reservation_id)
    );
"""
connection.execute(stmt)

### flight_seat table

In [265]:
# add a flight_seat_id index
df.insert(0, 'flight_seat_id', range(1, 1 + len(df)))

In [266]:
#create dataframe that contain all variable in the 'flight_seat' table
flight_seat_df = df[['flight_seat_id', 'seat_type', 'price', 'carryon_luggage', 'checked_luggage']]

In [267]:
#read dataset in the dataframe into the sql 
flight_seat_df.to_sql(name='flight_seat', con=engine, if_exists='append', index=False)

1000

### airline table

In [268]:
#create a airline data frame and drop duplicates rows
temp_airline_df = df[['airline_name', 'aircraft']].drop_duplicates().reset_index(drop=True)

In [269]:
#add a airline_id index that in the same length of the dataframe
temp_airline_df.insert(0, 'airline_id', range(1, 1+len(temp_airline_df)))

In [270]:
#show the dataframe
temp_airline_df

    airline_id        airline_name     aircraft
0            1   American Airlines  Airbus A320
1            2   American Airlines   Boeing 737
2            3     Delta Air Lines   Boeing 737
3            4     Delta Air Lines  Airbus A320
4            5  Southwest Airlines  Airbus A320
5            6  Southwest Airlines   Boeing 737
6            7     United Airlines   Boeing 737
7            8     United Airlines  Airbus A320
8            9     Alaska Airlines  Airbus A320
9           10     JetBlue Airways  Airbus A320
10          11     JetBlue Airways  Airbus A321
11          12     Spirit Airlines  Airbus A320

In [271]:
#read the dataframe into the sql
temp_airline_df.to_sql(name='airline', con=engine, if_exists='append', index=False)

12

### flight table

In [272]:
#create a flight dataframe and add the necessary varible into the dataframe
flight_df = df[['departure_city_id', 'arrival_city_id', 'airline_name', 'departure_date', 'arrival_date']]

In [273]:
#merge the flight dataframe and the airline dataframe when they share the same airline name
temp_flight_df = flight_df.merge(temp_airline_df, on = 'airline_name', how = 'left')

In [274]:
#create another dataframe that take the variable needed for the flight table
final_flight_df = temp_flight_df[['departure_city_id', 'arrival_city_id', 'airline_id', 'departure_date', 'arrival_date']].drop_duplicates().reset_index(drop=True)

In [275]:
#add a flight_id column
final_flight_df.insert(0, 'flight_id', range(1, 1+len(final_flight_df)))

In [276]:
#show the dataframe
final_flight_df

,flight_id,departure_city_id,arrival_city_id,airline_id,departure_date,arrival_date
0,1,109,211,1,6/3/2021 15:28,6/3/2021 23:28
1,2,109,211,2,6/3/2021 15:28,6/3/2021 23:28
2,3,106,234,1,4/8/2020 2:36,4/8/2020 9:36
3,4,106,234,2,4/8/2020 2:36,4/8/2020 9:36
4,5,131,13,1,1/3/2021 21:36,1/4/2021 8:36
...,...,...,...,...,...,...
1868,1869,124,87,12,4/23/2022 22:35,4/24/2022 1:35
1869,1870,36,104,12,11/18/2022 18:12,11/19/2022 1:12
1870,1871,13,232,12,6/14/2021 16:10,6/15/2021 1:10
1871,1872,158,238,12,3/5/2021 16:43,3/6/2021 3:43
1872,1873,243,113,12,3/10/2022 10:02,3/10/2022 22:02

In [277]:
#read the dataframe into the sql
final_flight_df.to_sql(name='flight', con=engine, if_exists='append', index=False)

873

### flight_reservations table

In [278]:
#merge the flight dataframe with the original dataset on the same departure_city_id
reservation_df = final_flight_df.merge(df, on = 'departure_city_id', how = 'left')

In [279]:
#sekect needed varible for the flight_reservation dataframe and drop the NA values
flight_reservation_df = reservation_df[['flight_id', 'user_id', 'flight_seat_id']].dropna()

In [280]:
#drop the duplicates in the dataframe
flight_reservation_df.drop_duplicates().reset_index(drop=True)

      flight_id  user_id  flight_seat_id
0             1    526.0             150
1             1     80.0             418
2             1    626.0             574
3             2    526.0             150
4             2     80.0             418
...         ...      ...             ...
4513       1872    587.0             252
4514       1872    366.0             423
4515       1872    625.0             449
4516       1873    640.0             474
4517       1873    297.0            1000

[4518 rows x 3 columns]

In [281]:
#add a flight reservation_id
flight_reservation_df.insert(0, 'flight_reservation_id', range(1, 1 + len(flight_reservation_df)))

In [282]:
#show the dataframe
flight_reservation_df

      flight_reservation_id  flight_id  user_id  flight_seat_id
1                         1          1    526.0             150
2                         2          1     80.0             418
3                         3          1    626.0             574
5                         4          2    526.0             150
6                         5          2     80.0             418
...                     ...        ...      ...             ...
8993                   4514       1872    587.0             252
8994                   4515       1872    366.0             423
8995                   4516       1872    625.0             449
8998                   4517       1873    640.0             474
9000                   4518       1873    297.0            1000

[4518 rows x 4 columns]

In [283]:
#read the dataframe into the sql
flight_reservation_df.to_sql(name='flight_reservation', con=engine, if_exists='append', index=False)

518

### order_flight table

In [284]:
#read the order csv into the dataframe
order_df = pd.read_csv('/Users/michellenie/Desktop/orders.csv')

In [285]:
#show the order dataframe
order_df

     order_id  user_id
0           1        1
1           2        2
2           3        3
3           4        4
4           5        5
..        ...      ...
995       996      996
996       997      997
997       998      998
998       999      999
999      1000     1000

[1000 rows x 2 columns]

In [286]:
#merge the order dataframe with the flight reservation on the same user_id
temp_order_flight_df = order_df.merge(flight_reservation_df, on = 'user_id', how = 'left').dropna()

In [287]:
#show the dataframe
temp_order_flight_df

      order_id  user_id  flight_reservation_id  flight_id  flight_seat_id
1            2        2                  323.0      141.0           973.0
2            2        2                  326.0      142.0           973.0
3            2        2                  927.0      387.0           973.0
4            2        2                  930.0      388.0           973.0
5            2        2                 1008.0      413.0           538.0
...        ...      ...                    ...        ...             ...
5122       999      999                 1717.0      707.0           262.0
5123       999      999                 1719.0      708.0           262.0
5124       999      999                 2841.0     1201.0           262.0
5125       999      999                 2843.0     1202.0           262.0
5126       999      999                 3718.0     1574.0           262.0

[4518 rows x 5 columns]

In [288]:
#add the order_id and flight_reservation_id into a new dataframe
order_flight_df = temp_order_flight_df[['order_id', 'flight_reservation_id']].drop_duplicates().reset_index(drop=True)

In [289]:
#show the new dataframe
order_flight_df

      order_id  flight_reservation_id
0            2                  323.0
1            2                  326.0
2            2                  927.0
3            2                  930.0
4            2                 1008.0
...        ...                    ...
4513       999                 1717.0
4514       999                 1719.0
4515       999                 2841.0
4516       999                 2843.0
4517       999                 3718.0

[4518 rows x 2 columns]

In [290]:
#read the new dataframe into the sql
order_flight_df.to_sql(name='order_flight', con=engine, if_exists='append', index=False)

518